{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "conv_256", "class_name": "SeparableConv2D", "config": {"name": "conv_256", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv_256", 0, 0, {}]]]}, {"name": "conv_128", "class_name": "SeparableConv2D", "config": {"name": "conv_128", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_128", 0, 0, {"training": 1}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv_64", "class_name": "SeparableConv2D", "config": {"name": "conv_64", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_64", 0, 0, {"training": 1}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv_32", "class_name": "SeparableConv2D", "config": {"name": "conv_32", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_32", 0, 0, {"training": 1}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv_16", "class_name": "SeparableConv2D", "config": {"name": "conv_16", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_16", 0, 0, {"training": 1}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv_8", "class_name": "SeparableConv2D", "config": {"name": "conv_8", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_8", 0, 0, {"training": 1}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "conv_4", "class_name": "SeparableConv2D", "config": {"name": "conv_4", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_4", 0, 0, {"training": 1}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv_2", "class_name": "SeparableConv2D", "config": {"name": "conv_2", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "separable_conv2d_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_1", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_1", 0, 0, {"training": 1}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {"training": 1}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["dropout_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "separable_conv2d_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_2", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_2", 0, 0, {"training": 1}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {"training": 1}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "separable_conv2d_3", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_3", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_3", 0, 0, {"training": 1}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {"training": 1}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}], ["dropout_3", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "separable_conv2d_4", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_4", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_4", 0, 0, {"training": 1}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "up_sampling2d_5", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_5", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "separable_conv2d_5", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_5", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_5", 0, 0, {"training": 1}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["batch_normalization_14", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "up_sampling2d_6", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_6", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "separable_conv2d_6", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_6", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_6", 0, 0, {"training": 1}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "up_sampling2d_7", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_7", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "separable_conv2d_7", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_7", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "axis": -1, "momentum": 0.9, "epsilon": 1.01e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "RandomNormal", "config": {"mean": 1.0, "stddev": 0.02, "seed": null}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_7", 0, 0, {"training": 1}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv_256", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "up_sampling2d_8", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_8", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "separable_conv2d_8", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_8", "trainable": true, "filters": 3, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["activation_9", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_11/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_12/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_13/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_14/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_15/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_16/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_6/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_8/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "batch_normalization_9/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv_128/depthwise_kernel", "shape": [4, 4, 64, 1], "dtype": "float32"}, {"name": "conv_128/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv_16/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "conv_16/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv_2/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "conv_2/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv_256/depthwise_kernel", "shape": [4, 4, 3, 1], "dtype": "float32"}, {"name": "conv_256/pointwise_kernel", "shape": [1, 1, 3, 64], "dtype": "float32"}, {"name": "conv_256/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv_32/depthwise_kernel", "shape": [4, 4, 256, 1], "dtype": "float32"}, {"name": "conv_32/pointwise_kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "conv_4/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "conv_4/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv_64/depthwise_kernel", "shape": [4, 4, 128, 1], "dtype": "float32"}, {"name": "conv_64/pointwise_kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "conv_8/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "conv_8/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "separable_conv2d_1/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "separable_conv2d_1/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "separable_conv2d_1/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "separable_conv2d_2/depthwise_kernel", "shape": [4, 4, 1024, 1], "dtype": "float32"}, {"name": "separable_conv2d_2/pointwise_kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "separable_conv2d_2/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "separable_conv2d_3/depthwise_kernel", "shape": [4, 4, 1024, 1], "dtype": "float32"}, {"name": "separable_conv2d_3/pointwise_kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "separable_conv2d_3/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "separable_conv2d_4/depthwise_kernel", "shape": [4, 4, 1024, 1], "dtype": "float32"}, {"name": "separable_conv2d_4/pointwise_kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "separable_conv2d_4/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "separable_conv2d_5/depthwise_kernel", "shape": [4, 4, 1024, 1], "dtype": "float32"}, {"name": "separable_conv2d_5/pointwise_kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "separable_conv2d_5/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group27-shard1of1"], "weights": [{"name": "separable_conv2d_6/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "separable_conv2d_6/pointwise_kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "separable_conv2d_6/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"name": "separable_conv2d_7/depthwise_kernel", "shape": [4, 4, 256, 1], "dtype": "float32"}, {"name": "separable_conv2d_7/pointwise_kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "separable_conv2d_7/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group29-shard1of1"], "weights": [{"name": "separable_conv2d_8/depthwise_kernel", "shape": [4, 4, 128, 1], "dtype": "float32"}, {"name": "separable_conv2d_8/pointwise_kernel", "shape": [1, 1, 128, 3], "dtype": "float32"}, {"name": "separable_conv2d_8/bias", "shape": [3], "dtype": "float32"}]}]}