{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_16", "layers": [{"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "separable_conv2d_61", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_61", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"name": "leaky_re_lu_64", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_64", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["separable_conv2d_61", 0, 0, {}]]]}, {"name": "separable_conv2d_62", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_62", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["leaky_re_lu_64", 0, 0, {}]]]}, {"name": "leaky_re_lu_65", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_65", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["separable_conv2d_62", 0, 0, {}]]]}, {"name": "batch_normalization_77", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_77", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_65", 0, 0, {}]]]}, {"name": "separable_conv2d_63", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_63", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["batch_normalization_77", 0, 0, {}]]]}, {"name": "leaky_re_lu_66", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_66", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["separable_conv2d_63", 0, 0, {}]]]}, {"name": "batch_normalization_78", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_78", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_66", 0, 0, {}]]]}, {"name": "separable_conv2d_64", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_64", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["batch_normalization_78", 0, 0, {}]]]}, {"name": "leaky_re_lu_67", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_67", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["separable_conv2d_64", 0, 0, {}]]]}, {"name": "batch_normalization_79", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_79", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_67", 0, 0, {}]]]}, {"name": "separable_conv2d_65", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_65", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["batch_normalization_79", 0, 0, {}]]]}, {"name": "leaky_re_lu_68", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_68", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["separable_conv2d_65", 0, 0, {}]]]}, {"name": "batch_normalization_80", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_80", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_68", 0, 0, {}]]]}, {"name": "separable_conv2d_66", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_66", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["batch_normalization_80", 0, 0, {}]]]}, {"name": "leaky_re_lu_69", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_69", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["separable_conv2d_66", 0, 0, {}]]]}, {"name": "batch_normalization_81", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_81", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_69", 0, 0, {}]]]}, {"name": "separable_conv2d_67", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_67", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["batch_normalization_81", 0, 0, {}]]]}, {"name": "leaky_re_lu_70", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_70", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["separable_conv2d_67", 0, 0, {}]]]}, {"name": "batch_normalization_82", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_82", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_70", 0, 0, {}]]]}, {"name": "up_sampling2d_30", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_30", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_82", 0, 0, {}]]]}, {"name": "separable_conv2d_68", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_68", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_30", 0, 0, {}]]]}, {"name": "batch_normalization_83", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_83", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_68", 0, 0, {}]]]}, {"name": "concatenate_33", "class_name": "Concatenate", "config": {"name": "concatenate_33", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_83", 0, 0, {}], ["batch_normalization_81", 0, 0, {}]]]}, {"name": "up_sampling2d_31", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_31", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_33", 0, 0, {}]]]}, {"name": "separable_conv2d_69", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_69", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_31", 0, 0, {}]]]}, {"name": "batch_normalization_84", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_84", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_69", 0, 0, {}]]]}, {"name": "concatenate_34", "class_name": "Concatenate", "config": {"name": "concatenate_34", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_84", 0, 0, {}], ["batch_normalization_80", 0, 0, {}]]]}, {"name": "up_sampling2d_32", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_32", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_34", 0, 0, {}]]]}, {"name": "separable_conv2d_70", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_70", "trainable": true, "filters": 512, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_32", 0, 0, {}]]]}, {"name": "batch_normalization_85", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_85", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_70", 0, 0, {}]]]}, {"name": "concatenate_35", "class_name": "Concatenate", "config": {"name": "concatenate_35", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_85", 0, 0, {}], ["batch_normalization_79", 0, 0, {}]]]}, {"name": "up_sampling2d_33", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_33", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_35", 0, 0, {}]]]}, {"name": "separable_conv2d_71", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_71", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_33", 0, 0, {}]]]}, {"name": "batch_normalization_86", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_86", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_71", 0, 0, {}]]]}, {"name": "concatenate_36", "class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_86", 0, 0, {}], ["batch_normalization_78", 0, 0, {}]]]}, {"name": "up_sampling2d_34", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_34", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"name": "separable_conv2d_72", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_72", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_34", 0, 0, {}]]]}, {"name": "batch_normalization_87", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_87", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_72", 0, 0, {}]]]}, {"name": "concatenate_37", "class_name": "Concatenate", "config": {"name": "concatenate_37", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_87", 0, 0, {}], ["batch_normalization_77", 0, 0, {}]]]}, {"name": "up_sampling2d_35", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_35", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_37", 0, 0, {}]]]}, {"name": "separable_conv2d_73", "class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_73", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["up_sampling2d_35", 0, 0, {}]]]}, {"name": "batch_normalization_88", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_88", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_73", 0, 0, {}]]]}, {"name": "concatenate_38", "class_name": "Concatenate", "config": {"name": "concatenate_38", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_88", 0, 0, {}], ["leaky_re_lu_64", 0, 0, {}]]]}, {"name": "up_sampling2d_36", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_36", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_38", 0, 0, {}]]]}, {"name": "conv2d_40", "class_name": "Conv2D", "config": {"name": "conv2d_40", "trainable": true, "filters": 3, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_36", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0]], "output_layers": [["conv2d_40", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_77/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_77/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_77/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_77/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_78/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_78/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_78/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_78/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_79/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_79/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_79/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_79/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_80/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_80/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_80/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_80/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_81/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_81/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_81/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_81/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_82/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_82/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_82/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_82/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_83/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_83/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_83/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_83/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_84/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_84/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_84/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_84/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_85/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_85/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_85/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_85/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_86/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_86/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_86/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_86/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_87/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_87/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_87/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_87/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_88/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_88/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_88/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_88/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv2d_40/kernel", "shape": [4, 4, 128, 3], "dtype": "float32"}, {"name": "conv2d_40/bias", "shape": [3], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "separable_conv2d_61/depthwise_kernel", "shape": [4, 4, 3, 1], "dtype": "float32"}, {"name": "separable_conv2d_61/pointwise_kernel", "shape": [1, 1, 3, 64], "dtype": "float32"}, {"name": "separable_conv2d_61/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "separable_conv2d_62/depthwise_kernel", "shape": [4, 4, 64, 1], "dtype": "float32"}, {"name": "separable_conv2d_62/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "separable_conv2d_62/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "separable_conv2d_63/depthwise_kernel", "shape": [4, 4, 128, 1], "dtype": "float32"}, {"name": "separable_conv2d_63/pointwise_kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "separable_conv2d_63/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "separable_conv2d_64/depthwise_kernel", "shape": [4, 4, 256, 1], "dtype": "float32"}, {"name": "separable_conv2d_64/pointwise_kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "separable_conv2d_64/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "separable_conv2d_65/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "separable_conv2d_65/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "separable_conv2d_65/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "separable_conv2d_66/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "separable_conv2d_66/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "separable_conv2d_66/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "separable_conv2d_67/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "separable_conv2d_67/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "separable_conv2d_67/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "separable_conv2d_68/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "separable_conv2d_68/pointwise_kernel", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "separable_conv2d_68/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "separable_conv2d_69/depthwise_kernel", "shape": [4, 4, 1024, 1], "dtype": "float32"}, {"name": "separable_conv2d_69/pointwise_kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "separable_conv2d_69/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "separable_conv2d_70/depthwise_kernel", "shape": [4, 4, 1024, 1], "dtype": "float32"}, {"name": "separable_conv2d_70/pointwise_kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "separable_conv2d_70/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "separable_conv2d_71/depthwise_kernel", "shape": [4, 4, 1024, 1], "dtype": "float32"}, {"name": "separable_conv2d_71/pointwise_kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "separable_conv2d_71/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "separable_conv2d_72/depthwise_kernel", "shape": [4, 4, 512, 1], "dtype": "float32"}, {"name": "separable_conv2d_72/pointwise_kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "separable_conv2d_72/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "separable_conv2d_73/depthwise_kernel", "shape": [4, 4, 256, 1], "dtype": "float32"}, {"name": "separable_conv2d_73/pointwise_kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "separable_conv2d_73/bias", "shape": [64], "dtype": "float32"}]}]}