{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "conv2d_44", "class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_44", 0, 0, {}]]]}, {"name": "conv2d_45", "class_name": "Conv2D", "config": {"name": "conv2d_45", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]]}, {"name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_45", 0, 0, {}]]]}, {"name": "batch_normalization_34", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_34", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]]}, {"name": "conv2d_46", "class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]]}, {"name": "leaky_re_lu_29", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_29", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_46", 0, 0, {}]]]}, {"name": "batch_normalization_35", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_35", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}]]]}, {"name": "conv2d_47", "class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"name": "leaky_re_lu_30", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_47", 0, 0, {}]]]}, {"name": "batch_normalization_36", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_36", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_30", 0, 0, {}]]]}, {"name": "conv2d_48", "class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"name": "leaky_re_lu_31", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_31", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_48", 0, 0, {}]]]}, {"name": "batch_normalization_37", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_37", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_31", 0, 0, {}]]]}, {"name": "conv2d_49", "class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "leaky_re_lu_32", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_32", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_49", 0, 0, {}]]]}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_38", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_32", 0, 0, {}]]]}, {"name": "conv2d_50", "class_name": "Conv2D", "config": {"name": "conv2d_50", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]]}, {"name": "leaky_re_lu_33", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_33", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_50", 0, 0, {}]]]}, {"name": "batch_normalization_39", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_39", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_33", 0, 0, {}]]]}, {"name": "up_sampling2d_15", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_15", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]]}, {"name": "conv2d_51", "class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_15", 0, 0, {}]]]}, {"name": "batch_normalization_40", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_40", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_51", 0, 0, {}]]]}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_40", 0, 0, {}], ["batch_normalization_38", 0, 0, {}]]]}, {"name": "up_sampling2d_16", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_16", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "conv2d_52", "class_name": "Conv2D", "config": {"name": "conv2d_52", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_16", 0, 0, {}]]]}, {"name": "batch_normalization_41", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_41", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_52", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_41", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "up_sampling2d_17", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_17", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "conv2d_53", "class_name": "Conv2D", "config": {"name": "conv2d_53", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_17", 0, 0, {}]]]}, {"name": "batch_normalization_42", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_42", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_53", 0, 0, {}]]]}, {"name": "concatenate_18", "class_name": "Concatenate", "config": {"name": "concatenate_18", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_42", 0, 0, {}], ["batch_normalization_36", 0, 0, {}]]]}, {"name": "up_sampling2d_18", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_18", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"name": "conv2d_54", "class_name": "Conv2D", "config": {"name": "conv2d_54", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_43", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_43", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_54", 0, 0, {}]]]}, {"name": "concatenate_19", "class_name": "Concatenate", "config": {"name": "concatenate_19", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_43", 0, 0, {}], ["batch_normalization_35", 0, 0, {}]]]}, {"name": "up_sampling2d_19", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_19", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_19", 0, 0, {}]]]}, {"name": "conv2d_55", "class_name": "Conv2D", "config": {"name": "conv2d_55", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_19", 0, 0, {}]]]}, {"name": "batch_normalization_44", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_44", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_55", 0, 0, {}]]]}, {"name": "concatenate_20", "class_name": "Concatenate", "config": {"name": "concatenate_20", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_44", 0, 0, {}], ["batch_normalization_34", 0, 0, {}]]]}, {"name": "up_sampling2d_20", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_20", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]]}, {"name": "conv2d_56", "class_name": "Conv2D", "config": {"name": "conv2d_56", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_20", 0, 0, {}]]]}, {"name": "batch_normalization_45", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_45", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_56", 0, 0, {}]]]}, {"name": "concatenate_21", "class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_45", 0, 0, {}], ["leaky_re_lu_27", 0, 0, {}]]]}, {"name": "up_sampling2d_21", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_21", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"name": "conv2d_57", "class_name": "Conv2D", "config": {"name": "conv2d_57", "trainable": true, "filters": 3, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_21", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["conv2d_57", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_34/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_34/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_34/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_34/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_35/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_35/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_35/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_35/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_36/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_36/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_36/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_36/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_37/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_37/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_37/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_37/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_38/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_38/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_39/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_39/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_40/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_40/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_41/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_41/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_41/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_41/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_42/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_42/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_43/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_43/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_43/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_43/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_44/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_44/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_44/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_44/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_45/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_45/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_45/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_45/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv2d_44/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "conv2d_44/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv2d_45/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "conv2d_45/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_46/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "conv2d_46/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group16-shard1of2", "group16-shard2of2"], "weights": [{"name": "conv2d_47/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_47/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group17-shard1of2", "group17-shard2of2"], "weights": [{"name": "conv2d_48/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_48/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group18-shard1of2", "group18-shard2of2"], "weights": [{"name": "conv2d_49/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_49/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group19-shard1of2", "group19-shard2of2"], "weights": [{"name": "conv2d_50/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_50/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group20-shard1of2", "group20-shard2of2"], "weights": [{"name": "conv2d_51/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_51/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group21-shard1of3", "group21-shard2of3", "group21-shard3of3"], "weights": [{"name": "conv2d_52/kernel", "shape": [4, 4, 512, 256], "dtype": "float32"}, {"name": "conv2d_52/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group22-shard1of3", "group22-shard2of3", "group22-shard3of3"], "weights": [{"name": "conv2d_53/kernel", "shape": [4, 4, 512, 256], "dtype": "float32"}, {"name": "conv2d_53/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group23-shard1of3", "group23-shard2of3", "group23-shard3of3"], "weights": [{"name": "conv2d_54/kernel", "shape": [4, 4, 512, 256], "dtype": "float32"}, {"name": "conv2d_54/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group24-shard1of2", "group24-shard2of2"], "weights": [{"name": "conv2d_55/kernel", "shape": [4, 4, 512, 128], "dtype": "float32"}, {"name": "conv2d_55/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "conv2d_56/kernel", "shape": [4, 4, 256, 64], "dtype": "float32"}, {"name": "conv2d_56/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "conv2d_57/kernel", "shape": [4, 4, 128, 3], "dtype": "float32"}, {"name": "conv2d_57/bias", "shape": [3], "dtype": "float32"}]}]}