{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_19", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"name": "leaky_re_lu_20", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "leaky_re_lu_21", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "leaky_re_lu_22", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "leaky_re_lu_23", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"name": "leaky_re_lu_24", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"name": "leaky_re_lu_25", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_27", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]]}, {"name": "up_sampling2d_8", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_8", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_28", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["batch_normalization_26", 0, 0, {}]]]}, {"name": "up_sampling2d_9", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_9", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_9", 0, 0, {}]]]}, {"name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_29", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}], ["batch_normalization_25", 0, 0, {}]]]}, {"name": "up_sampling2d_10", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_10", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 256, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_10", 0, 0, {}]]]}, {"name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_30", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "concatenate_10", "class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}], ["batch_normalization_24", 0, 0, {}]]]}, {"name": "up_sampling2d_11", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_11", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_11", 0, 0, {}]]]}, {"name": "batch_normalization_31", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_31", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"name": "concatenate_11", "class_name": "Concatenate", "config": {"name": "concatenate_11", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_31", 0, 0, {}], ["batch_normalization_23", 0, 0, {}]]]}, {"name": "up_sampling2d_12", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_12", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_11", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_12", 0, 0, {}]]]}, {"name": "batch_normalization_32", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_32", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"name": "concatenate_12", "class_name": "Concatenate", "config": {"name": "concatenate_12", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}], ["batch_normalization_22", 0, 0, {}]]]}, {"name": "up_sampling2d_13", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_13", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"name": "conv2d_33", "class_name": "Conv2D", "config": {"name": "conv2d_33", "trainable": true, "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_13", 0, 0, {}]]]}, {"name": "batch_normalization_33", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_33", "trainable": true, "axis": -1, "momentum": 0.8, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]]}, {"name": "concatenate_13", "class_name": "Concatenate", "config": {"name": "concatenate_13", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_33", 0, 0, {}], ["leaky_re_lu_19", 0, 0, {}]]]}, {"name": "up_sampling2d_14", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_14", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}, {"name": "conv2d_34", "class_name": "Conv2D", "config": {"name": "conv2d_34", "trainable": true, "filters": 3, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_14", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["conv2d_34", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_22/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_23/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_24/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_25/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_26/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_27/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_27/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_27/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_27/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_28/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_28/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_29/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_29/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_29/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_29/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_30/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_30/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_30/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_30/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_31/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_31/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_31/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_31/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "batch_normalization_32/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_32/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_32/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_32/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_33/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_33/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_33/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_33/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv2d_21/kernel", "shape": [4, 4, 3, 32], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv2d_22/kernel", "shape": [4, 4, 32, 64], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_23/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv2d_24/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group17-shard1of2", "group17-shard2of2"], "weights": [{"name": "conv2d_25/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_25/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group18-shard1of2", "group18-shard2of2"], "weights": [{"name": "conv2d_26/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_26/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group19-shard1of2", "group19-shard2of2"], "weights": [{"name": "conv2d_27/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_27/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group20-shard1of2", "group20-shard2of2"], "weights": [{"name": "conv2d_28/kernel", "shape": [4, 4, 256, 256], "dtype": "float32"}, {"name": "conv2d_28/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group21-shard1of3", "group21-shard2of3", "group21-shard3of3"], "weights": [{"name": "conv2d_29/kernel", "shape": [4, 4, 512, 256], "dtype": "float32"}, {"name": "conv2d_29/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group22-shard1of3", "group22-shard2of3", "group22-shard3of3"], "weights": [{"name": "conv2d_30/kernel", "shape": [4, 4, 512, 256], "dtype": "float32"}, {"name": "conv2d_30/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group23-shard1of2", "group23-shard2of2"], "weights": [{"name": "conv2d_31/kernel", "shape": [4, 4, 512, 128], "dtype": "float32"}, {"name": "conv2d_31/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "conv2d_32/kernel", "shape": [4, 4, 256, 64], "dtype": "float32"}, {"name": "conv2d_32/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"name": "conv2d_33/kernel", "shape": [4, 4, 128, 32], "dtype": "float32"}, {"name": "conv2d_33/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"name": "conv2d_34/kernel", "shape": [4, 4, 64, 3], "dtype": "float32"}, {"name": "conv2d_34/bias", "shape": [3], "dtype": "float32"}]}]}